keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G10_BOUND.
* To use register names with standard convension, please use VADC_G10_BOUND.
*/
#define	VADC_G10BOUND	(VADC_G10_BOUND)

/** \\brief  2D90, Channel Event Flag Clear Register, Group */
#define VADC_G10_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0022D90u)

/** Alias (User Manual Name) for VADC_G10_CEFCLR.
* To use register names with standard convension, please use VADC_G10_CEFCLR.
*/
#define	VADC_G10CEFCLR	(VADC_G10_CEFCLR)

/** \\brief  2D80, Channel Event Flag Register, Group */
#define VADC_G10_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0022D80u)

/** Alias (User Manual Name) for VADC_G10_CEFLAG.
* To use register names with standard convension, please use VADC_G10_CEFLAG.
*/
#define	VADC_G10CEFLAG	(VADC_G10_CEFLAG)

/** \\brief  2DA0, Channel Event Node Pointer Register 0, Group */
#define VADC_G10_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF0022DA0u)

/** Alias (User Manual Name) for VADC_G10_CEVNP0.
* To use register names with standard convension, please use VADC_G10_CEVNP0.
*/
#define	VADC_G10CEVNP0	(VADC_G10_CEVNP0)

/** \\brief  2C88, Channel Assignment Register, Group */
#define VADC_G10_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0022C88u)

/** Alias (User Manual Name) for VADC_G10_CHASS.
* To use register names with standard convension, please use VADC_G10_CHASS.
*/
#define	VADC_G10CHASS	(VADC_G10_CHASS)

/** \\brief  2E00, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E00u)

/** Alias (User Manual Name) for VADC_G10_CHCTR0.
* To use register names with standard convension, please use VADC_G10_CHCTR0.
*/
#define	VADC_G10CHCTR0	(VADC_G10_CHCTR0)

/** \\brief  2E04, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E04u)

/** Alias (User Manual Name) for VADC_G10_CHCTR1.
* To use register names with standard convension, please use VADC_G10_CHCTR1.
*/
#define	VADC_G10CHCTR1	(VADC_G10_CHCTR1)

/** \\brief  2E28, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E28u)

/** \\brief  2E2C, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E2Cu)

/** \\brief  2E30, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E30u)

/** \\brief  2E34, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E34u)

/** \\brief  2E38, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E38u)

/** \\brief  2E3C, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E3Cu)

/** \\brief  2E08, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E08u)

/** Alias (User Manual Name) for VADC_G10_CHCTR2.
* To use register names with standard convension, please use VADC_G10_CHCTR2.
*/
#define	VADC_G10CHCTR2	(VADC_G10_CHCTR2)

/** \\brief  2E0C, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E0Cu)

/** Alias (User Manual Name) for VADC_G10_CHCTR3.
* To use register names with standard convension, please use VADC_G10_CHCTR3.
*/
#define	VADC_G10CHCTR3	(VADC_G10_CHCTR3)

/** \\brief  2E10, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E10u)

/** Alias (User Manual Name) for VADC_G10_CHCTR4.
* To use register names with standard convension, please use VADC_G10_CHCTR4.
*/
#define	VADC_G10CHCTR4	(VADC_G10_CHCTR4)

/** \\brief  2E14, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E14u)

/** Alias (User Manual Name) for VADC_G10_CHCTR5.
* To use register names with standard convension, please use VADC_G10_CHCTR5.
*/
#define	VADC_G10CHCTR5	(VADC_G10_CHCTR5)

/** \\brief  2E18, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E18u)

/** Alias (User Manual Name) for VADC_G10_CHCTR6.
* To use register names with standard convension, please use VADC_G10_CHCTR6.
*/
#define	VADC_G10CHCTR6	(VADC_G10_CHCTR6)

/** \\brief  2E1C, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E1Cu)

/** Alias (User Manual Name) for VADC_G10_CHCTR7.
* To use register names with standard convension, please use VADC_G10_CHCTR7.
*/
#define	VADC_G10CHCTR7	(VADC_G10_CHCTR7)

/** \\brief  2E20, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E20u)

/** \\brief  2E24, Group, Channel Ctrl. Reg. */
#define VADC_G10_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022E24u)

/** \\brief  2DF0, External Multiplexer Control Register, Group x */
#define VADC_G10_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF0022DF0u)

/** Alias (User Manual Name) for VADC_G10_EMUXCTR.
* To use register names with standard convension, please use VADC_G10_EMUXCTR.
*/
#define	VADC_G10EMUXCTR	(VADC_G10_EMUXCTR)

/** \\brief  2CA0, Input Class Register */
#define VADC_G10_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF0022CA0u)

/** Alias (User Manual Name) for VADC_G10_ICLASS0.
* To use register names with standard convension, please use VADC_G10_ICLASS0.
*/
#define	VADC_G10ICLASS0	(VADC_G10_ICLASS0)

/** \\brief  2CA4, Input Class Register */
#define VADC_G10_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF0022CA4u)

/** Alias (User Manual Name) for VADC_G10_ICLASS1.
* To use register names with standard convension, please use VADC_G10_ICLASS1.
*/
#define	VADC_G10ICLASS1	(VADC_G10_ICLASS1)

/** \\brief  2D0C, Queue 0 Register 0, Group */
#define VADC_G10_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF0022D0Cu)

/** Alias (User Manual Name) for VADC_G10_Q0R0.
* To use register names with standard convension, please use VADC_G10_Q0R0.
*/
#define	VADC_G10Q0R0	(VADC_G10_Q0R0)

/** \\brief  2D10, Queue 0 Input Register, Group */
#define VADC_G10_QBUR_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR_QINR0*)0xF0022D10u)

/** Alias (User Manual Name) for VADC_G10_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G10_QBUR_QINR0.
*/
#define	VADC_G10QBUR0	(VADC_G10_QBUR_QINR0)

/** Alias (User Manual Name) for VADC_G10_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G10_QBUR_QINR0.
*/
#define	VADC_G10QINR0	(VADC_G10_QBUR_QINR0)

/** \\brief  2D00, Queue 0 Source Control Register, Group */
#define VADC_G10_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0022D00u)

/** Alias (User Manual Name) for VADC_G10_QCTRL0.
* To use register names with standard convension, please use VADC_G10_QCTRL0.
*/
#define	VADC_G10QCTRL0	(VADC_G10_QCTRL0)

/** \\brief  2D04, Queue 0 Mode Register, Group */
#define VADC_G10_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0022D04u)

