keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G10_RESD12.
* To use register names with standard convension, please use VADC_G10_RESD12.
*/
#define	VADC_G10RESD12	(VADC_G10_RESD12)

/** \\brief  2FB4, Group Result Reg., Debug */
#define VADC_G10_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FB4u)

/** Alias (User Manual Name) for VADC_G10_RESD13.
* To use register names with standard convension, please use VADC_G10_RESD13.
*/
#define	VADC_G10RESD13	(VADC_G10_RESD13)

/** \\brief  2FB8, Group Result Reg., Debug */
#define VADC_G10_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FB8u)

/** Alias (User Manual Name) for VADC_G10_RESD14.
* To use register names with standard convension, please use VADC_G10_RESD14.
*/
#define	VADC_G10RESD14	(VADC_G10_RESD14)

/** \\brief  2FBC, Group Result Reg., Debug */
#define VADC_G10_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FBCu)

/** Alias (User Manual Name) for VADC_G10_RESD15.
* To use register names with standard convension, please use VADC_G10_RESD15.
*/
#define	VADC_G10RESD15	(VADC_G10_RESD15)

/** \\brief  2F88, Group Result Reg., Debug */
#define VADC_G10_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F88u)

/** Alias (User Manual Name) for VADC_G10_RESD2.
* To use register names with standard convension, please use VADC_G10_RESD2.
*/
#define	VADC_G10RESD2	(VADC_G10_RESD2)

/** \\brief  2F8C, Group Result Reg., Debug */
#define VADC_G10_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F8Cu)

/** Alias (User Manual Name) for VADC_G10_RESD3.
* To use register names with standard convension, please use VADC_G10_RESD3.
*/
#define	VADC_G10RESD3	(VADC_G10_RESD3)

/** \\brief  2F90, Group Result Reg., Debug */
#define VADC_G10_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F90u)

/** Alias (User Manual Name) for VADC_G10_RESD4.
* To use register names with standard convension, please use VADC_G10_RESD4.
*/
#define	VADC_G10RESD4	(VADC_G10_RESD4)

/** \\brief  2F94, Group Result Reg., Debug */
#define VADC_G10_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F94u)

/** Alias (User Manual Name) for VADC_G10_RESD5.
* To use register names with standard convension, please use VADC_G10_RESD5.
*/
#define	VADC_G10RESD5	(VADC_G10_RESD5)

/** \\brief  2F98, Group Result Reg., Debug */
#define VADC_G10_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F98u)

/** Alias (User Manual Name) for VADC_G10_RESD6.
* To use register names with standard convension, please use VADC_G10_RESD6.
*/
#define	VADC_G10RESD6	(VADC_G10_RESD6)

/** \\brief  2F9C, Group Result Reg., Debug */
#define VADC_G10_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022F9Cu)

/** Alias (User Manual Name) for VADC_G10_RESD7.
* To use register names with standard convension, please use VADC_G10_RESD7.
*/
#define	VADC_G10RESD7	(VADC_G10_RESD7)

/** \\brief  2FA0, Group Result Reg., Debug */
#define VADC_G10_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FA0u)

/** Alias (User Manual Name) for VADC_G10_RESD8.
* To use register names with standard convension, please use VADC_G10_RESD8.
*/
#define	VADC_G10RESD8	(VADC_G10_RESD8)

/** \\brief  2FA4, Group Result Reg., Debug */
#define VADC_G10_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022FA4u)

/** Alias (User Manual Name) for VADC_G10_RESD9.
* To use register names with standard convension, please use VADC_G10_RESD9.
*/
#define	VADC_G10RESD9	(VADC_G10_RESD9)

/** \\brief  2DB0, Result Event Node Pointer Register 0, Group */
#define VADC_G10_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF0022DB0u)

/** Alias (User Manual Name) for VADC_G10_REVNP0.
* To use register names with standard convension, please use VADC_G10_REVNP0.
*/
#define	VADC_G10REVNP0	(VADC_G10_REVNP0)

/** \\brief  2DB4, Result Event Node Pointer Register 1, Group */
#define VADC_G10_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF0022DB4u)

/** Alias (User Manual Name) for VADC_G10_REVNP1.
* To use register names with standard convension, please use VADC_G10_REVNP1.
*/
#define	VADC_G10REVNP1	(VADC_G10_REVNP1)

/** \\brief  2C8C, Result Assignment Register, Group */
#define VADC_G10_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF0022C8Cu)

/** Alias (User Manual Name) for VADC_G10_RRASS.
* To use register names with standard convension, please use VADC_G10_RRASS.
*/
#define	VADC_G10RRASS	(VADC_G10_RRASS)

/** \\brief  2D98, Source Event Flag Clear Register, Group */
#define VADC_G10_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0022D98u)

/** Alias (User Manual Name) for VADC_G10_SEFCLR.
* To use register names with standard convension, please use VADC_G10_SEFCLR.
*/
#define	VADC_G10SEFCLR	(VADC_G10_SEFCLR)

/** \\brief  2D88, Source Event Flag Register, Group */
#define VADC_G10_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0022D88u)

/** Alias (User Manual Name) for VADC_G10_SEFLAG.
* To use register names with standard convension, please use VADC_G10_SEFLAG.
*/
#define	VADC_G10SEFLAG	(VADC_G10_SEFLAG)

/** \\brief  2DC0, Source Event Node Pointer Register, Group */
#define VADC_G10_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF0022DC0u)

/** Alias (User Manual Name) for VADC_G10_SEVNP.
* To use register names with standard convension, please use VADC_G10_SEVNP.
*/
#define	VADC_G10SEVNP	(VADC_G10_SEVNP)

/** \\brief  2DC8, Service Request Software Activation Trigger, Group */
#define VADC_G10_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF0022DC8u)

/** Alias (User Manual Name) for VADC_G10_SRACT.
* To use register names with standard convension, please use VADC_G10_SRACT.
*/
#define	VADC_G10SRACT	(VADC_G10_SRACT)

/** \\brief  2CC0, Synchronization Control Register, Group */
#define VADC_G10_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF0022CC0u)

/** Alias (User Manual Name) for VADC_G10_SYNCTR.
* To use register names with standard convension, please use VADC_G10_SYNCTR.
*/
#define	VADC_G10SYNCTR	(VADC_G10_SYNCTR)

