keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G5_RES4.
* To use register names with standard convension, please use VADC_G5_RES4.
*/
#define	VADC_G5RES4	(VADC_G5_RES4)

/** \\brief  1B14, Group Result Register */
#define VADC_G5_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021B14u)

/** Alias (User Manual Name) for VADC_G5_RES5.
* To use register names with standard convension, please use VADC_G5_RES5.
*/
#define	VADC_G5RES5	(VADC_G5_RES5)

/** \\brief  1B18, Group Result Register */
#define VADC_G5_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021B18u)

/** Alias (User Manual Name) for VADC_G5_RES6.
* To use register names with standard convension, please use VADC_G5_RES6.
*/
#define	VADC_G5RES6	(VADC_G5_RES6)

/** \\brief  1B1C, Group Result Register */
#define VADC_G5_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021B1Cu)

/** Alias (User Manual Name) for VADC_G5_RES7.
* To use register names with standard convension, please use VADC_G5_RES7.
*/
#define	VADC_G5RES7	(VADC_G5_RES7)

/** \\brief  1B20, Group Result Register */
#define VADC_G5_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021B20u)

/** Alias (User Manual Name) for VADC_G5_RES8.
* To use register names with standard convension, please use VADC_G5_RES8.
*/
#define	VADC_G5RES8	(VADC_G5_RES8)

/** \\brief  1B24, Group Result Register */
#define VADC_G5_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021B24u)

/** Alias (User Manual Name) for VADC_G5_RES9.
* To use register names with standard convension, please use VADC_G5_RES9.
*/
#define	VADC_G5RES9	(VADC_G5_RES9)

/** \\brief  1B80, Group Result Reg., Debug */
#define VADC_G5_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B80u)

/** Alias (User Manual Name) for VADC_G5_RESD0.
* To use register names with standard convension, please use VADC_G5_RESD0.
*/
#define	VADC_G5RESD0	(VADC_G5_RESD0)

/** \\brief  1B84, Group Result Reg., Debug */
#define VADC_G5_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B84u)

/** Alias (User Manual Name) for VADC_G5_RESD1.
* To use register names with standard convension, please use VADC_G5_RESD1.
*/
#define	VADC_G5RESD1	(VADC_G5_RESD1)

/** \\brief  1BA8, Group Result Reg., Debug */
#define VADC_G5_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BA8u)

/** Alias (User Manual Name) for VADC_G5_RESD10.
* To use register names with standard convension, please use VADC_G5_RESD10.
*/
#define	VADC_G5RESD10	(VADC_G5_RESD10)

/** \\brief  1BAC, Group Result Reg., Debug */
#define VADC_G5_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BACu)

/** Alias (User Manual Name) for VADC_G5_RESD11.
* To use register names with standard convension, please use VADC_G5_RESD11.
*/
#define	VADC_G5RESD11	(VADC_G5_RESD11)

/** \\brief  1BB0, Group Result Reg., Debug */
#define VADC_G5_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BB0u)

/** Alias (User Manual Name) for VADC_G5_RESD12.
* To use register names with standard convension, please use VADC_G5_RESD12.
*/
#define	VADC_G5RESD12	(VADC_G5_RESD12)

/** \\brief  1BB4, Group Result Reg., Debug */
#define VADC_G5_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BB4u)

/** Alias (User Manual Name) for VADC_G5_RESD13.
* To use register names with standard convension, please use VADC_G5_RESD13.
*/
#define	VADC_G5RESD13	(VADC_G5_RESD13)

/** \\brief  1BB8, Group Result Reg., Debug */
#define VADC_G5_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BB8u)

/** Alias (User Manual Name) for VADC_G5_RESD14.
* To use register names with standard convension, please use VADC_G5_RESD14.
*/
#define	VADC_G5RESD14	(VADC_G5_RESD14)

/** \\brief  1BBC, Group Result Reg., Debug */
#define VADC_G5_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BBCu)

/** Alias (User Manual Name) for VADC_G5_RESD15.
* To use register names with standard convension, please use VADC_G5_RESD15.
*/
#define	VADC_G5RESD15	(VADC_G5_RESD15)

/** \\brief  1B88, Group Result Reg., Debug */
#define VADC_G5_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B88u)

/** Alias (User Manual Name) for VADC_G5_RESD2.
* To use register names with standard convension, please use VADC_G5_RESD2.
*/
#define	VADC_G5RESD2	(VADC_G5_RESD2)

/** \\brief  1B8C, Group Result Reg., Debug */
#define VADC_G5_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B8Cu)

/** Alias (User Manual Name) for VADC_G5_RESD3.
* To use register names with standard convension, please use VADC_G5_RESD3.
*/
#define	VADC_G5RESD3	(VADC_G5_RESD3)

/** \\brief  1B90, Group Result Reg., Debug */
#define VADC_G5_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B90u)

/** Alias (User Manual Name) for VADC_G5_RESD4.
* To use register names with standard convension, please use VADC_G5_RESD4.
*/
#define	VADC_G5RESD4	(VADC_G5_RESD4)

/** \\brief  1B94, Group Result Reg., Debug */
#define VADC_G5_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B94u)

/** Alias (User Manual Name) for VADC_G5_RESD5.
* To use register names with standard convension, please use VADC_G5_RESD5.
*/
#define	VADC_G5RESD5	(VADC_G5_RESD5)

/** \\brief  1B98, Group Result Reg., Debug */
#define VADC_G5_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B98u)

/** Alias (User Manual Name) for VADC_G5_RESD6.
* To use register names with standard convension, please use VADC_G5_RESD6.
*/
#define	VADC_G5RESD6	(VADC_G5_RESD6)

/** \\brief  1B9C, Group Result Reg., Debug */
#define VADC_G5_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B9Cu)

/** Alias (User Manual Name) for VADC_G5_RESD7.
* To use register names with standard convension, please use VADC_G5_RESD7.
*/
#define	VADC_G5RESD7	(VADC_G5_RESD7)

/** \\brief  1BA0, Group Result Reg., Debug */
#define VADC_G5_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BA0u)

