keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** \\brief  1D0C, Queue 0 Register 0, Group */
#define VADC_G6_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF0021D0Cu)

/** Alias (User Manual Name) for VADC_G6_Q0R0.
* To use register names with standard convension, please use VADC_G6_Q0R0.
*/
#define	VADC_G6Q0R0	(VADC_G6_Q0R0)

/** \\brief  1D10, Queue 0 Input Register, Group */
#define VADC_G6_QBUR_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR_QINR0*)0xF0021D10u)

/** Alias (User Manual Name) for VADC_G6_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G6_QBUR_QINR0.
*/
#define	VADC_G6QBUR0	(VADC_G6_QBUR_QINR0)

/** Alias (User Manual Name) for VADC_G6_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G6_QBUR_QINR0.
*/
#define	VADC_G6QINR0	(VADC_G6_QBUR_QINR0)

/** \\brief  1D00, Queue 0 Source Control Register, Group */
#define VADC_G6_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0021D00u)

/** Alias (User Manual Name) for VADC_G6_QCTRL0.
* To use register names with standard convension, please use VADC_G6_QCTRL0.
*/
#define	VADC_G6QCTRL0	(VADC_G6_QCTRL0)

/** \\brief  1D04, Queue 0 Mode Register, Group */
#define VADC_G6_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0021D04u)

/** Alias (User Manual Name) for VADC_G6_QMR0.
* To use register names with standard convension, please use VADC_G6_QMR0.
*/
#define	VADC_G6QMR0	(VADC_G6_QMR0)

/** \\brief  1D08, Queue 0 Status Register, Group */
#define VADC_G6_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0021D08u)

/** Alias (User Manual Name) for VADC_G6_QSR0.
* To use register names with standard convension, please use VADC_G6_QSR0.
*/
#define	VADC_G6QSR0	(VADC_G6_QSR0)

/** \\brief  1E80, Group Result Control Reg. */
#define VADC_G6_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E80u)

/** Alias (User Manual Name) for VADC_G6_RCR0.
* To use register names with standard convension, please use VADC_G6_RCR0.
*/
#define	VADC_G6RCR0	(VADC_G6_RCR0)

/** \\brief  1E84, Group Result Control Reg. */
#define VADC_G6_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E84u)

/** Alias (User Manual Name) for VADC_G6_RCR1.
* To use register names with standard convension, please use VADC_G6_RCR1.
*/
#define	VADC_G6RCR1	(VADC_G6_RCR1)

/** \\brief  1EA8, Group Result Control Reg. */
#define VADC_G6_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EA8u)

/** Alias (User Manual Name) for VADC_G6_RCR10.
* To use register names with standard convension, please use VADC_G6_RCR10.
*/
#define	VADC_G6RCR10	(VADC_G6_RCR10)

/** \\brief  1EAC, Group Result Control Reg. */
#define VADC_G6_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EACu)

/** Alias (User Manual Name) for VADC_G6_RCR11.
* To use register names with standard convension, please use VADC_G6_RCR11.
*/
#define	VADC_G6RCR11	(VADC_G6_RCR11)

/** \\brief  1EB0, Group Result Control Reg. */
#define VADC_G6_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EB0u)

/** Alias (User Manual Name) for VADC_G6_RCR12.
* To use register names with standard convension, please use VADC_G6_RCR12.
*/
#define	VADC_G6RCR12	(VADC_G6_RCR12)

/** \\brief  1EB4, Group Result Control Reg. */
#define VADC_G6_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EB4u)

/** Alias (User Manual Name) for VADC_G6_RCR13.
* To use register names with standard convension, please use VADC_G6_RCR13.
*/
#define	VADC_G6RCR13	(VADC_G6_RCR13)

/** \\brief  1EB8, Group Result Control Reg. */
#define VADC_G6_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EB8u)

/** Alias (User Manual Name) for VADC_G6_RCR14.
* To use register names with standard convension, please use VADC_G6_RCR14.
*/
#define	VADC_G6RCR14	(VADC_G6_RCR14)

/** \\brief  1EBC, Group Result Control Reg. */
#define VADC_G6_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EBCu)

/** Alias (User Manual Name) for VADC_G6_RCR15.
* To use register names with standard convension, please use VADC_G6_RCR15.
*/
#define	VADC_G6RCR15	(VADC_G6_RCR15)

/** \\brief  1E88, Group Result Control Reg. */
#define VADC_G6_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E88u)

/** Alias (User Manual Name) for VADC_G6_RCR2.
* To use register names with standard convension, please use VADC_G6_RCR2.
*/
#define	VADC_G6RCR2	(VADC_G6_RCR2)

/** \\brief  1E8C, Group Result Control Reg. */
#define VADC_G6_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E8Cu)

/** Alias (User Manual Name) for VADC_G6_RCR3.
* To use register names with standard convension, please use VADC_G6_RCR3.
*/
#define	VADC_G6RCR3	(VADC_G6_RCR3)

/** \\brief  1E90, Group Result Control Reg. */
#define VADC_G6_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E90u)

/** Alias (User Manual Name) for VADC_G6_RCR4.
* To use register names with standard convension, please use VADC_G6_RCR4.
*/
#define	VADC_G6RCR4	(VADC_G6_RCR4)

/** \\brief  1E94, Group Result Control Reg. */
#define VADC_G6_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E94u)

/** Alias (User Manual Name) for VADC_G6_RCR5.
* To use register names with standard convension, please use VADC_G6_RCR5.
*/
#define	VADC_G6RCR5	(VADC_G6_RCR5)

/** \\brief  1E98, Group Result Control Reg. */
#define VADC_G6_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E98u)

/** Alias (User Manual Name) for VADC_G6_RCR6.
* To use register names with standard convension, please use VADC_G6_RCR6.
*/
#define	VADC_G6RCR6	(VADC_G6_RCR6)

/** \\brief  1E9C, Group Result Control Reg. */
#define VADC_G6_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021E9Cu)

/** Alias (User Manual Name) for VADC_G6_RCR7.
* To use register names with standard convension, please use VADC_G6_RCR7.
*/
#define	VADC_G6RCR7	(VADC_G6_RCR7)

/** \\brief  1EA0, Group Result Control Reg. */
#define VADC_G6_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EA0u)

/** Alias (User Manual Name) for VADC_G6_RCR8.
* To use register names with standard convension, please use VADC_G6_RCR8.
*/
#define	VADC_G6RCR8	(VADC_G6_RCR8)

/** \\brief  1EA4, Group Result Control Reg. */
#define VADC_G6_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021EA4u)

/** Alias (User Manual Name) for VADC_G6_RCR9.
* To use register names with standard convension, please use VADC_G6_RCR9.
*/
#define	VADC_G6RCR9	(VADC_G6_RCR9)

/** \\brief  1D94, Result Event Flag Clear Register, Group */
#define VADC_G6_REFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFCLR*)0xF0021D94u)

/** Alias (User Manual Name) for VADC_G6_REFCLR.
* To use register names with standard convension, please use VADC_G6_REFCLR.
*/
#define	VADC_G6REFCLR	(VADC_G6_REFCLR)

