keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G6_RESD14.
* To use register names with standard convension, please use VADC_G6_RESD14.
*/
#define	VADC_G6RESD14	(VADC_G6_RESD14)

/** \\brief  1FBC, Group Result Reg., Debug */
#define VADC_G6_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021FBCu)

/** Alias (User Manual Name) for VADC_G6_RESD15.
* To use register names with standard convension, please use VADC_G6_RESD15.
*/
#define	VADC_G6RESD15	(VADC_G6_RESD15)

/** \\brief  1F88, Group Result Reg., Debug */
#define VADC_G6_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021F88u)

/** Alias (User Manual Name) for VADC_G6_RESD2.
* To use register names with standard convension, please use VADC_G6_RESD2.
*/
#define	VADC_G6RESD2	(VADC_G6_RESD2)

/** \\brief  1F8C, Group Result Reg., Debug */
#define VADC_G6_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021F8Cu)

/** Alias (User Manual Name) for VADC_G6_RESD3.
* To use register names with standard convension, please use VADC_G6_RESD3.
*/
#define	VADC_G6RESD3	(VADC_G6_RESD3)

/** \\brief  1F90, Group Result Reg., Debug */
#define VADC_G6_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021F90u)

/** Alias (User Manual Name) for VADC_G6_RESD4.
* To use register names with standard convension, please use VADC_G6_RESD4.
*/
#define	VADC_G6RESD4	(VADC_G6_RESD4)

/** \\brief  1F94, Group Result Reg., Debug */
#define VADC_G6_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021F94u)

/** Alias (User Manual Name) for VADC_G6_RESD5.
* To use register names with standard convension, please use VADC_G6_RESD5.
*/
#define	VADC_G6RESD5	(VADC_G6_RESD5)

/** \\brief  1F98, Group Result Reg., Debug */
#define VADC_G6_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021F98u)

/** Alias (User Manual Name) for VADC_G6_RESD6.
* To use register names with standard convension, please use VADC_G6_RESD6.
*/
#define	VADC_G6RESD6	(VADC_G6_RESD6)

/** \\brief  1F9C, Group Result Reg., Debug */
#define VADC_G6_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021F9Cu)

/** Alias (User Manual Name) for VADC_G6_RESD7.
* To use register names with standard convension, please use VADC_G6_RESD7.
*/
#define	VADC_G6RESD7	(VADC_G6_RESD7)

/** \\brief  1FA0, Group Result Reg., Debug */
#define VADC_G6_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021FA0u)

/** Alias (User Manual Name) for VADC_G6_RESD8.
* To use register names with standard convension, please use VADC_G6_RESD8.
*/
#define	VADC_G6RESD8	(VADC_G6_RESD8)

/** \\brief  1FA4, Group Result Reg., Debug */
#define VADC_G6_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021FA4u)

/** Alias (User Manual Name) for VADC_G6_RESD9.
* To use register names with standard convension, please use VADC_G6_RESD9.
*/
#define	VADC_G6RESD9	(VADC_G6_RESD9)

/** \\brief  1DB0, Result Event Node Pointer Register 0, Group */
#define VADC_G6_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF0021DB0u)

/** Alias (User Manual Name) for VADC_G6_REVNP0.
* To use register names with standard convension, please use VADC_G6_REVNP0.
*/
#define	VADC_G6REVNP0	(VADC_G6_REVNP0)

/** \\brief  1DB4, Result Event Node Pointer Register 1, Group */
#define VADC_G6_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF0021DB4u)

/** Alias (User Manual Name) for VADC_G6_REVNP1.
* To use register names with standard convension, please use VADC_G6_REVNP1.
*/
#define	VADC_G6REVNP1	(VADC_G6_REVNP1)

/** \\brief  1C8C, Result Assignment Register, Group */
#define VADC_G6_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF0021C8Cu)

/** Alias (User Manual Name) for VADC_G6_RRASS.
* To use register names with standard convension, please use VADC_G6_RRASS.
*/
#define	VADC_G6RRASS	(VADC_G6_RRASS)

/** \\brief  1D98, Source Event Flag Clear Register, Group */
#define VADC_G6_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0021D98u)

/** Alias (User Manual Name) for VADC_G6_SEFCLR.
* To use register names with standard convension, please use VADC_G6_SEFCLR.
*/
#define	VADC_G6SEFCLR	(VADC_G6_SEFCLR)

/** \\brief  1D88, Source Event Flag Register, Group */
#define VADC_G6_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0021D88u)

/** Alias (User Manual Name) for VADC_G6_SEFLAG.
* To use register names with standard convension, please use VADC_G6_SEFLAG.
*/
#define	VADC_G6SEFLAG	(VADC_G6_SEFLAG)

/** \\brief  1DC0, Source Event Node Pointer Register, Group */
#define VADC_G6_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF0021DC0u)

/** Alias (User Manual Name) for VADC_G6_SEVNP.
* To use register names with standard convension, please use VADC_G6_SEVNP.
*/
#define	VADC_G6SEVNP	(VADC_G6_SEVNP)

/** \\brief  1DC8, Service Request Software Activation Trigger, Group */
#define VADC_G6_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF0021DC8u)

/** Alias (User Manual Name) for VADC_G6_SRACT.
* To use register names with standard convension, please use VADC_G6_SRACT.
*/
#define	VADC_G6SRACT	(VADC_G6_SRACT)

/** \\brief  1CC0, Synchronization Control Register, Group */
#define VADC_G6_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF0021CC0u)

/** Alias (User Manual Name) for VADC_G6_SYNCTR.
* To use register names with standard convension, please use VADC_G6_SYNCTR.
*/
#define	VADC_G6SYNCTR	(VADC_G6_SYNCTR)

/** \\brief  1DF8, Valid Flag Register, Group */
#define VADC_G6_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF0021DF8u)

/** Alias (User Manual Name) for VADC_G6_VFR.
* To use register names with standard convension, please use VADC_G6_VFR.
*/
#define	VADC_G6VFR	(VADC_G6_VFR)

/** \\brief  20B0, Alias Register, Group */
#define VADC_G7_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF00220B0u)

/** Alias (User Manual Name) for VADC_G7_ALIAS.
* To use register names with standard convension, please use VADC_G7_ALIAS.
*/
#define	VADC_G7ALIAS	(VADC_G7_ALIAS)

/** \\brief  2080, Arbitration Configuration Register, Group */
#define VADC_G7_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0022080u)

