keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G7_CHCTR3.
* To use register names with standard convension, please use VADC_G7_CHCTR3.
*/
#define	VADC_G7CHCTR3	(VADC_G7_CHCTR3)

/** \\brief  2210, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022210u)

/** Alias (User Manual Name) for VADC_G7_CHCTR4.
* To use register names with standard convension, please use VADC_G7_CHCTR4.
*/
#define	VADC_G7CHCTR4	(VADC_G7_CHCTR4)

/** \\brief  2214, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022214u)

/** Alias (User Manual Name) for VADC_G7_CHCTR5.
* To use register names with standard convension, please use VADC_G7_CHCTR5.
*/
#define	VADC_G7CHCTR5	(VADC_G7_CHCTR5)

/** \\brief  2218, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022218u)

/** Alias (User Manual Name) for VADC_G7_CHCTR6.
* To use register names with standard convension, please use VADC_G7_CHCTR6.
*/
#define	VADC_G7CHCTR6	(VADC_G7_CHCTR6)

/** \\brief  221C, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002221Cu)

/** Alias (User Manual Name) for VADC_G7_CHCTR7.
* To use register names with standard convension, please use VADC_G7_CHCTR7.
*/
#define	VADC_G7CHCTR7	(VADC_G7_CHCTR7)

/** \\brief  2220, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022220u)

/** \\brief  2224, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022224u)

/** \\brief  21F0, External Multiplexer Control Register, Group x */
#define VADC_G7_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00221F0u)

/** Alias (User Manual Name) for VADC_G7_EMUXCTR.
* To use register names with standard convension, please use VADC_G7_EMUXCTR.
*/
#define	VADC_G7EMUXCTR	(VADC_G7_EMUXCTR)

/** \\brief  20A0, Input Class Register */
#define VADC_G7_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00220A0u)

/** Alias (User Manual Name) for VADC_G7_ICLASS0.
* To use register names with standard convension, please use VADC_G7_ICLASS0.
*/
#define	VADC_G7ICLASS0	(VADC_G7_ICLASS0)

/** \\brief  20A4, Input Class Register */
#define VADC_G7_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00220A4u)

/** Alias (User Manual Name) for VADC_G7_ICLASS1.
* To use register names with standard convension, please use VADC_G7_ICLASS1.
*/
#define	VADC_G7ICLASS1	(VADC_G7_ICLASS1)

/** \\brief  210C, Queue 0 Register 0, Group */
#define VADC_G7_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002210Cu)

/** Alias (User Manual Name) for VADC_G7_Q0R0.
* To use register names with standard convension, please use VADC_G7_Q0R0.
*/
#define	VADC_G7Q0R0	(VADC_G7_Q0R0)

/** \\brief  2110, Queue 0 Input Register, Group */
#define VADC_G7_QBUR_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR_QINR0*)0xF0022110u)

/** Alias (User Manual Name) for VADC_G7_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G7_QBUR_QINR0.
*/
#define	VADC_G7QINR0	(VADC_G7_QBUR_QINR0)

/** Alias (User Manual Name) for VADC_G7_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G7_QBUR_QINR0.
*/
#define	VADC_G7QBUR0	(VADC_G7_QBUR_QINR0)

/** \\brief  2100, Queue 0 Source Control Register, Group */
#define VADC_G7_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0022100u)

/** Alias (User Manual Name) for VADC_G7_QCTRL0.
* To use register names with standard convension, please use VADC_G7_QCTRL0.
*/
#define	VADC_G7QCTRL0	(VADC_G7_QCTRL0)

/** \\brief  2104, Queue 0 Mode Register, Group */
#define VADC_G7_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0022104u)

/** Alias (User Manual Name) for VADC_G7_QMR0.
* To use register names with standard convension, please use VADC_G7_QMR0.
*/
#define	VADC_G7QMR0	(VADC_G7_QMR0)

/** \\brief  2108, Queue 0 Status Register, Group */
#define VADC_G7_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0022108u)

/** Alias (User Manual Name) for VADC_G7_QSR0.
* To use register names with standard convension, please use VADC_G7_QSR0.
*/
#define	VADC_G7QSR0	(VADC_G7_QSR0)

/** \\brief  2280, Group Result Control Reg. */
#define VADC_G7_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022280u)

/** Alias (User Manual Name) for VADC_G7_RCR0.
* To use register names with standard convension, please use VADC_G7_RCR0.
*/
#define	VADC_G7RCR0	(VADC_G7_RCR0)

/** \\brief  2284, Group Result Control Reg. */
#define VADC_G7_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022284u)

/** Alias (User Manual Name) for VADC_G7_RCR1.
* To use register names with standard convension, please use VADC_G7_RCR1.
*/
#define	VADC_G7RCR1	(VADC_G7_RCR1)

/** \\brief  22A8, Group Result Control Reg. */
#define VADC_G7_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00222A8u)

/** Alias (User Manual Name) for VADC_G7_RCR10.
* To use register names with standard convension, please use VADC_G7_RCR10.
*/
#define	VADC_G7RCR10	(VADC_G7_RCR10)

/** \\brief  22AC, Group Result Control Reg. */
#define VADC_G7_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00222ACu)

/** Alias (User Manual Name) for VADC_G7_RCR11.
* To use register names with standard convension, please use VADC_G7_RCR11.
*/
#define	VADC_G7RCR11	(VADC_G7_RCR11)

/** \\brief  22B0, Group Result Control Reg. */
#define VADC_G7_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00222B0u)

/** Alias (User Manual Name) for VADC_G7_RCR12.
* To use register names with standard convension, please use VADC_G7_RCR12.
*/
#define	VADC_G7RCR12	(VADC_G7_RCR12)

/** \\brief  22B4, Group Result Control Reg. */
#define VADC_G7_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00222B4u)

