keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G7_RCR13.
* To use register names with standard convension, please use VADC_G7_RCR13.
*/
#define	VADC_G7RCR13	(VADC_G7_RCR13)

/** \\brief  22B8, Group Result Control Reg. */
#define VADC_G7_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00222B8u)

/** Alias (User Manual Name) for VADC_G7_RCR14.
* To use register names with standard convension, please use VADC_G7_RCR14.
*/
#define	VADC_G7RCR14	(VADC_G7_RCR14)

/** \\brief  22BC, Group Result Control Reg. */
#define VADC_G7_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00222BCu)

/** Alias (User Manual Name) for VADC_G7_RCR15.
* To use register names with standard convension, please use VADC_G7_RCR15.
*/
#define	VADC_G7RCR15	(VADC_G7_RCR15)

/** \\brief  2288, Group Result Control Reg. */
#define VADC_G7_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022288u)

/** Alias (User Manual Name) for VADC_G7_RCR2.
* To use register names with standard convension, please use VADC_G7_RCR2.
*/
#define	VADC_G7RCR2	(VADC_G7_RCR2)

/** \\brief  228C, Group Result Control Reg. */
#define VADC_G7_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF002228Cu)

/** Alias (User Manual Name) for VADC_G7_RCR3.
* To use register names with standard convension, please use VADC_G7_RCR3.
*/
#define	VADC_G7RCR3	(VADC_G7_RCR3)

/** \\brief  2290, Group Result Control Reg. */
#define VADC_G7_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022290u)

/** Alias (User Manual Name) for VADC_G7_RCR4.
* To use register names with standard convension, please use VADC_G7_RCR4.
*/
#define	VADC_G7RCR4	(VADC_G7_RCR4)

/** \\brief  2294, Group Result Control Reg. */
#define VADC_G7_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022294u)

/** Alias (User Manual Name) for VADC_G7_RCR5.
* To use register names with standard convension, please use VADC_G7_RCR5.
*/
#define	VADC_G7RCR5	(VADC_G7_RCR5)

/** \\brief  2298, Group Result Control Reg. */
#define VADC_G7_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022298u)

/** Alias (User Manual Name) for VADC_G7_RCR6.
* To use register names with standard convension, please use VADC_G7_RCR6.
*/
#define	VADC_G7RCR6	(VADC_G7_RCR6)

/** \\brief  229C, Group Result Control Reg. */
#define VADC_G7_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF002229Cu)

/** Alias (User Manual Name) for VADC_G7_RCR7.
* To use register names with standard convension, please use VADC_G7_RCR7.
*/
#define	VADC_G7RCR7	(VADC_G7_RCR7)

/** \\brief  22A0, Group Result Control Reg. */
#define VADC_G7_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00222A0u)

/** Alias (User Manual Name) for VADC_G7_RCR8.
* To use register names with standard convension, please use VADC_G7_RCR8.
*/
#define	VADC_G7RCR8	(VADC_G7_RCR8)

/** \\brief  22A4, Group Result Control Reg. */
#define VADC_G7_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00222A4u)

/** Alias (User Manual Name) for VADC_G7_RCR9.
* To use register names with standard convension, please use VADC_G7_RCR9.
*/
#define	VADC_G7RCR9	(VADC_G7_RCR9)

/** \\brief  2194, Result Event Flag Clear Register, Group */
#define VADC_G7_REFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFCLR*)0xF0022194u)

/** Alias (User Manual Name) for VADC_G7_REFCLR.
* To use register names with standard convension, please use VADC_G7_REFCLR.
*/
#define	VADC_G7REFCLR	(VADC_G7_REFCLR)

/** \\brief  2184, Result Event Flag Register, Group */
#define VADC_G7_REFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFLAG*)0xF0022184u)

/** Alias (User Manual Name) for VADC_G7_REFLAG.
* To use register names with standard convension, please use VADC_G7_REFLAG.
*/
#define	VADC_G7REFLAG	(VADC_G7_REFLAG)

/** \\brief  2300, Group Result Register */
#define VADC_G7_RES0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022300u)

/** Alias (User Manual Name) for VADC_G7_RES0.
* To use register names with standard convension, please use VADC_G7_RES0.
*/
#define	VADC_G7RES0	(VADC_G7_RES0)

/** \\brief  2304, Group Result Register */
#define VADC_G7_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022304u)

/** Alias (User Manual Name) for VADC_G7_RES1.
* To use register names with standard convension, please use VADC_G7_RES1.
*/
#define	VADC_G7RES1	(VADC_G7_RES1)

/** \\brief  2328, Group Result Register */
#define VADC_G7_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022328u)

/** Alias (User Manual Name) for VADC_G7_RES10.
* To use register names with standard convension, please use VADC_G7_RES10.
*/
#define	VADC_G7RES10	(VADC_G7_RES10)

/** \\brief  232C, Group Result Register */
#define VADC_G7_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002232Cu)

/** Alias (User Manual Name) for VADC_G7_RES11.
* To use register names with standard convension, please use VADC_G7_RES11.
*/
#define	VADC_G7RES11	(VADC_G7_RES11)

/** \\brief  2330, Group Result Register */
#define VADC_G7_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022330u)

/** Alias (User Manual Name) for VADC_G7_RES12.
* To use register names with standard convension, please use VADC_G7_RES12.
*/
#define	VADC_G7RES12	(VADC_G7_RES12)

/** \\brief  2334, Group Result Register */
#define VADC_G7_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022334u)

/** Alias (User Manual Name) for VADC_G7_RES13.
* To use register names with standard convension, please use VADC_G7_RES13.
*/
#define	VADC_G7RES13	(VADC_G7_RES13)

/** \\brief  2338, Group Result Register */
#define VADC_G7_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022338u)

/** Alias (User Manual Name) for VADC_G7_RES14.
* To use register names with standard convension, please use VADC_G7_RES14.
*/
#define	VADC_G7RES14	(VADC_G7_RES14)

/** \\brief  233C, Group Result Register */
#define VADC_G7_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002233Cu)

/** Alias (User Manual Name) for VADC_G7_RES15.
* To use register names with standard convension, please use VADC_G7_RES15.
*/
#define	VADC_G7RES15	(VADC_G7_RES15)

