keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G7_RESD9.
* To use register names with standard convension, please use VADC_G7_RESD9.
*/
#define	VADC_G7RESD9	(VADC_G7_RESD9)

/** \\brief  21B0, Result Event Node Pointer Register 0, Group */
#define VADC_G7_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF00221B0u)

/** Alias (User Manual Name) for VADC_G7_REVNP0.
* To use register names with standard convension, please use VADC_G7_REVNP0.
*/
#define	VADC_G7REVNP0	(VADC_G7_REVNP0)

/** \\brief  21B4, Result Event Node Pointer Register 1, Group */
#define VADC_G7_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF00221B4u)

/** Alias (User Manual Name) for VADC_G7_REVNP1.
* To use register names with standard convension, please use VADC_G7_REVNP1.
*/
#define	VADC_G7REVNP1	(VADC_G7_REVNP1)

/** \\brief  208C, Result Assignment Register, Group */
#define VADC_G7_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF002208Cu)

/** Alias (User Manual Name) for VADC_G7_RRASS.
* To use register names with standard convension, please use VADC_G7_RRASS.
*/
#define	VADC_G7RRASS	(VADC_G7_RRASS)

/** \\brief  2198, Source Event Flag Clear Register, Group */
#define VADC_G7_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0022198u)

/** Alias (User Manual Name) for VADC_G7_SEFCLR.
* To use register names with standard convension, please use VADC_G7_SEFCLR.
*/
#define	VADC_G7SEFCLR	(VADC_G7_SEFCLR)

/** \\brief  2188, Source Event Flag Register, Group */
#define VADC_G7_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0022188u)

/** Alias (User Manual Name) for VADC_G7_SEFLAG.
* To use register names with standard convension, please use VADC_G7_SEFLAG.
*/
#define	VADC_G7SEFLAG	(VADC_G7_SEFLAG)

/** \\brief  21C0, Source Event Node Pointer Register, Group */
#define VADC_G7_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00221C0u)

/** Alias (User Manual Name) for VADC_G7_SEVNP.
* To use register names with standard convension, please use VADC_G7_SEVNP.
*/
#define	VADC_G7SEVNP	(VADC_G7_SEVNP)

/** \\brief  21C8, Service Request Software Activation Trigger, Group */
#define VADC_G7_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00221C8u)

/** Alias (User Manual Name) for VADC_G7_SRACT.
* To use register names with standard convension, please use VADC_G7_SRACT.
*/
#define	VADC_G7SRACT	(VADC_G7_SRACT)

/** \\brief  20C0, Synchronization Control Register, Group */
#define VADC_G7_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00220C0u)

/** Alias (User Manual Name) for VADC_G7_SYNCTR.
* To use register names with standard convension, please use VADC_G7_SYNCTR.
*/
#define	VADC_G7SYNCTR	(VADC_G7_SYNCTR)

/** \\brief  21F8, Valid Flag Register, Group */
#define VADC_G7_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00221F8u)

/** Alias (User Manual Name) for VADC_G7_VFR.
* To use register names with standard convension, please use VADC_G7_VFR.
*/
#define	VADC_G7VFR	(VADC_G7_VFR)

/** \\brief  24B0, Alias Register, Group */
#define VADC_G8_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF00224B0u)

/** Alias (User Manual Name) for VADC_G8_ALIAS.
* To use register names with standard convension, please use VADC_G8_ALIAS.
*/
#define	VADC_G8ALIAS	(VADC_G8_ALIAS)

/** \\brief  2480, Arbitration Configuration Register, Group */
#define VADC_G8_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0022480u)

/** Alias (User Manual Name) for VADC_G8_ARBCFG.
* To use register names with standard convension, please use VADC_G8_ARBCFG.
*/
#define	VADC_G8ARBCFG	(VADC_G8_ARBCFG)

/** \\brief  2484, Arbitration Priority Register, Group */
#define VADC_G8_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0022484u)

/** Alias (User Manual Name) for VADC_G8_ARBPR.
* To use register names with standard convension, please use VADC_G8_ARBPR.
*/
#define	VADC_G8ARBPR	(VADC_G8_ARBPR)

/** \\brief  2520, Autoscan Source Control Register, Group */
#define VADC_G8_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0022520u)

/** Alias (User Manual Name) for VADC_G8_ASCTRL.
* To use register names with standard convension, please use VADC_G8_ASCTRL.
*/
#define	VADC_G8ASCTRL	(VADC_G8_ASCTRL)

/** \\brief  2524, Autoscan Source Mode Register, Group */
#define VADC_G8_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0022524u)

/** Alias (User Manual Name) for VADC_G8_ASMR.
* To use register names with standard convension, please use VADC_G8_ASMR.
*/
#define	VADC_G8ASMR	(VADC_G8_ASMR)

/** \\brief  252C, Autoscan Source Pending Register, Group */
#define VADC_G8_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF002252Cu)

/** Alias (User Manual Name) for VADC_G8_ASPND.
* To use register names with standard convension, please use VADC_G8_ASPND.
*/
#define	VADC_G8ASPND	(VADC_G8_ASPND)

/** \\brief  2528, Autoscan Source Channel Select Register, Group */
#define VADC_G8_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0022528u)

/** Alias (User Manual Name) for VADC_G8_ASSEL.
* To use register names with standard convension, please use VADC_G8_ASSEL.
*/
#define	VADC_G8ASSEL	(VADC_G8_ASSEL)

/** \\brief  24C8, Boundary Flag Register, Group */
#define VADC_G8_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00224C8u)

/** Alias (User Manual Name) for VADC_G8_BFL.
* To use register names with standard convension, please use VADC_G8_BFL.
*/
#define	VADC_G8BFL	(VADC_G8_BFL)

/** \\brief  24D0, Boundary Flag Control Register, Group */
#define VADC_G8_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF00224D0u)

/** Alias (User Manual Name) for VADC_G8_BFLC.
* To use register names with standard convension, please use VADC_G8_BFLC.
*/
#define	VADC_G8BFLC	(VADC_G8_BFLC)

/** \\brief  24D4, Boundary Flag Node Pointer Register, Group */
#define VADC_G8_BFLNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLNP*)0xF00224D4u)

/** Alias (User Manual Name) for VADC_G8_BFLNP.
* To use register names with standard convension, please use VADC_G8_BFLNP.
*/
#define	VADC_G8BFLNP	(VADC_G8_BFLNP)

/** \\brief  24CC, Boundary Flag Software Register, Group */
#define VADC_G8_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF00224CCu)

/** Alias (User Manual Name) for VADC_G8_BFLS.
* To use register names with standard convension, please use VADC_G8_BFLS.
*/
#define	VADC_G8BFLS	(VADC_G8_BFLS)

/** \\brief  24B8, Boundary Select Register, Group */
#define VADC_G8_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF00224B8u)

/** Alias (User Manual Name) for VADC_G8_BOUND.
* To use register names with standard convension, please use VADC_G8_BOUND.
*/
#define	VADC_G8BOUND	(VADC_G8_BOUND)

/** \\brief  2590, Channel Event Flag Clear Register, Group */
#define VADC_G8_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0022590u)

/** Alias (User Manual Name) for VADC_G8_CEFCLR.
* To use register names with standard convension, please use VADC_G8_CEFCLR.
*/
#define	VADC_G8CEFCLR	(VADC_G8_CEFCLR)

/** \\brief  2580, Channel Event Flag Register, Group */
#define VADC_G8_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0022580u)

