keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G8_CEFLAG.
* To use register names with standard convension, please use VADC_G8_CEFLAG.
*/
#define	VADC_G8CEFLAG	(VADC_G8_CEFLAG)

/** \\brief  25A0, Channel Event Node Pointer Register 0, Group */
#define VADC_G8_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF00225A0u)

/** Alias (User Manual Name) for VADC_G8_CEVNP0.
* To use register names with standard convension, please use VADC_G8_CEVNP0.
*/
#define	VADC_G8CEVNP0	(VADC_G8_CEVNP0)

/** \\brief  2488, Channel Assignment Register, Group */
#define VADC_G8_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0022488u)

/** Alias (User Manual Name) for VADC_G8_CHASS.
* To use register names with standard convension, please use VADC_G8_CHASS.
*/
#define	VADC_G8CHASS	(VADC_G8_CHASS)

/** \\brief  2600, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022600u)

/** Alias (User Manual Name) for VADC_G8_CHCTR0.
* To use register names with standard convension, please use VADC_G8_CHCTR0.
*/
#define	VADC_G8CHCTR0	(VADC_G8_CHCTR0)

/** \\brief  2604, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022604u)

/** Alias (User Manual Name) for VADC_G8_CHCTR1.
* To use register names with standard convension, please use VADC_G8_CHCTR1.
*/
#define	VADC_G8CHCTR1	(VADC_G8_CHCTR1)

/** \\brief  2628, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022628u)

/** \\brief  262C, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002262Cu)

/** \\brief  2630, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022630u)

/** \\brief  2634, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022634u)

/** \\brief  2638, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022638u)

/** \\brief  263C, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002263Cu)

/** \\brief  2608, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022608u)

/** Alias (User Manual Name) for VADC_G8_CHCTR2.
* To use register names with standard convension, please use VADC_G8_CHCTR2.
*/
#define	VADC_G8CHCTR2	(VADC_G8_CHCTR2)

/** \\brief  260C, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002260Cu)

/** Alias (User Manual Name) for VADC_G8_CHCTR3.
* To use register names with standard convension, please use VADC_G8_CHCTR3.
*/
#define	VADC_G8CHCTR3	(VADC_G8_CHCTR3)

/** \\brief  2610, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022610u)

/** Alias (User Manual Name) for VADC_G8_CHCTR4.
* To use register names with standard convension, please use VADC_G8_CHCTR4.
*/
#define	VADC_G8CHCTR4	(VADC_G8_CHCTR4)

/** \\brief  2614, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022614u)

/** Alias (User Manual Name) for VADC_G8_CHCTR5.
* To use register names with standard convension, please use VADC_G8_CHCTR5.
*/
#define	VADC_G8CHCTR5	(VADC_G8_CHCTR5)

/** \\brief  2618, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022618u)

/** Alias (User Manual Name) for VADC_G8_CHCTR6.
* To use register names with standard convension, please use VADC_G8_CHCTR6.
*/
#define	VADC_G8CHCTR6	(VADC_G8_CHCTR6)

/** \\brief  261C, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002261Cu)

/** Alias (User Manual Name) for VADC_G8_CHCTR7.
* To use register names with standard convension, please use VADC_G8_CHCTR7.
*/
#define	VADC_G8CHCTR7	(VADC_G8_CHCTR7)

/** \\brief  2620, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022620u)

/** \\brief  2624, Group, Channel Ctrl. Reg. */
#define VADC_G8_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022624u)

/** \\brief  25F0, External Multiplexer Control Register, Group x */
#define VADC_G8_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00225F0u)

/** Alias (User Manual Name) for VADC_G8_EMUXCTR.
* To use register names with standard convension, please use VADC_G8_EMUXCTR.
*/
#define	VADC_G8EMUXCTR	(VADC_G8_EMUXCTR)

/** \\brief  24A0, Input Class Register */
#define VADC_G8_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00224A0u)

/** Alias (User Manual Name) for VADC_G8_ICLASS0.
* To use register names with standard convension, please use VADC_G8_ICLASS0.
*/
#define	VADC_G8ICLASS0	(VADC_G8_ICLASS0)

/** \\brief  24A4, Input Class Register */
#define VADC_G8_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00224A4u)

/** Alias (User Manual Name) for VADC_G8_ICLASS1.
* To use register names with standard convension, please use VADC_G8_ICLASS1.
*/
#define	VADC_G8ICLASS1	(VADC_G8_ICLASS1)

/** \\brief  250C, Queue 0 Register 0, Group */
#define VADC_G8_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002250Cu)

/** Alias (User Manual Name) for VADC_G8_Q0R0.
* To use register names with standard convension, please use VADC_G8_Q0R0.
*/
#define	VADC_G8Q0R0	(VADC_G8_Q0R0)

/** \\brief  2510, Queue 0 Input Register, Group */
#define VADC_G8_QBUR_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR_QINR0*)0xF0022510u)

/** Alias (User Manual Name) for VADC_G8_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G8_QBUR_QINR0.
*/
#define	VADC_G8QINR0	(VADC_G8_QBUR_QINR0)

/** Alias (User Manual Name) for VADC_G8_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G8_QBUR_QINR0.
*/
#define	VADC_G8QBUR0	(VADC_G8_QBUR_QINR0)

/** \\brief  2500, Queue 0 Source Control Register, Group */
#define VADC_G8_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0022500u)

/** Alias (User Manual Name) for VADC_G8_QCTRL0.
* To use register names with standard convension, please use VADC_G8_QCTRL0.
*/
#define	VADC_G8QCTRL0	(VADC_G8_QCTRL0)

/** \\brief  2504, Queue 0 Mode Register, Group */
#define VADC_G8_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0022504u)

