keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G8_RES0.
* To use register names with standard convension, please use VADC_G8_RES0.
*/
#define	VADC_G8RES0	(VADC_G8_RES0)

/** \\brief  2704, Group Result Register */
#define VADC_G8_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022704u)

/** Alias (User Manual Name) for VADC_G8_RES1.
* To use register names with standard convension, please use VADC_G8_RES1.
*/
#define	VADC_G8RES1	(VADC_G8_RES1)

/** \\brief  2728, Group Result Register */
#define VADC_G8_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022728u)

/** Alias (User Manual Name) for VADC_G8_RES10.
* To use register names with standard convension, please use VADC_G8_RES10.
*/
#define	VADC_G8RES10	(VADC_G8_RES10)

/** \\brief  272C, Group Result Register */
#define VADC_G8_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002272Cu)

/** Alias (User Manual Name) for VADC_G8_RES11.
* To use register names with standard convension, please use VADC_G8_RES11.
*/
#define	VADC_G8RES11	(VADC_G8_RES11)

/** \\brief  2730, Group Result Register */
#define VADC_G8_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022730u)

/** Alias (User Manual Name) for VADC_G8_RES12.
* To use register names with standard convension, please use VADC_G8_RES12.
*/
#define	VADC_G8RES12	(VADC_G8_RES12)

/** \\brief  2734, Group Result Register */
#define VADC_G8_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022734u)

/** Alias (User Manual Name) for VADC_G8_RES13.
* To use register names with standard convension, please use VADC_G8_RES13.
*/
#define	VADC_G8RES13	(VADC_G8_RES13)

/** \\brief  2738, Group Result Register */
#define VADC_G8_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022738u)

/** Alias (User Manual Name) for VADC_G8_RES14.
* To use register names with standard convension, please use VADC_G8_RES14.
*/
#define	VADC_G8RES14	(VADC_G8_RES14)

/** \\brief  273C, Group Result Register */
#define VADC_G8_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002273Cu)

/** Alias (User Manual Name) for VADC_G8_RES15.
* To use register names with standard convension, please use VADC_G8_RES15.
*/
#define	VADC_G8RES15	(VADC_G8_RES15)

/** \\brief  2708, Group Result Register */
#define VADC_G8_RES2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022708u)

/** Alias (User Manual Name) for VADC_G8_RES2.
* To use register names with standard convension, please use VADC_G8_RES2.
*/
#define	VADC_G8RES2	(VADC_G8_RES2)

/** \\brief  270C, Group Result Register */
#define VADC_G8_RES3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002270Cu)

/** Alias (User Manual Name) for VADC_G8_RES3.
* To use register names with standard convension, please use VADC_G8_RES3.
*/
#define	VADC_G8RES3	(VADC_G8_RES3)

/** \\brief  2710, Group Result Register */
#define VADC_G8_RES4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022710u)

/** Alias (User Manual Name) for VADC_G8_RES4.
* To use register names with standard convension, please use VADC_G8_RES4.
*/
#define	VADC_G8RES4	(VADC_G8_RES4)

/** \\brief  2714, Group Result Register */
#define VADC_G8_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022714u)

/** Alias (User Manual Name) for VADC_G8_RES5.
* To use register names with standard convension, please use VADC_G8_RES5.
*/
#define	VADC_G8RES5	(VADC_G8_RES5)

/** \\brief  2718, Group Result Register */
#define VADC_G8_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022718u)

/** Alias (User Manual Name) for VADC_G8_RES6.
* To use register names with standard convension, please use VADC_G8_RES6.
*/
#define	VADC_G8RES6	(VADC_G8_RES6)

/** \\brief  271C, Group Result Register */
#define VADC_G8_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002271Cu)

/** Alias (User Manual Name) for VADC_G8_RES7.
* To use register names with standard convension, please use VADC_G8_RES7.
*/
#define	VADC_G8RES7	(VADC_G8_RES7)

/** \\brief  2720, Group Result Register */
#define VADC_G8_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022720u)

/** Alias (User Manual Name) for VADC_G8_RES8.
* To use register names with standard convension, please use VADC_G8_RES8.
*/
#define	VADC_G8RES8	(VADC_G8_RES8)

/** \\brief  2724, Group Result Register */
#define VADC_G8_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022724u)

/** Alias (User Manual Name) for VADC_G8_RES9.
* To use register names with standard convension, please use VADC_G8_RES9.
*/
#define	VADC_G8RES9	(VADC_G8_RES9)

/** \\brief  2780, Group Result Reg., Debug */
#define VADC_G8_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022780u)

/** Alias (User Manual Name) for VADC_G8_RESD0.
* To use register names with standard convension, please use VADC_G8_RESD0.
*/
#define	VADC_G8RESD0	(VADC_G8_RESD0)

/** \\brief  2784, Group Result Reg., Debug */
#define VADC_G8_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022784u)

/** Alias (User Manual Name) for VADC_G8_RESD1.
* To use register names with standard convension, please use VADC_G8_RESD1.
*/
#define	VADC_G8RESD1	(VADC_G8_RESD1)

/** \\brief  27A8, Group Result Reg., Debug */
#define VADC_G8_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00227A8u)

/** Alias (User Manual Name) for VADC_G8_RESD10.
* To use register names with standard convension, please use VADC_G8_RESD10.
*/
#define	VADC_G8RESD10	(VADC_G8_RESD10)

/** \\brief  27AC, Group Result Reg., Debug */
#define VADC_G8_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00227ACu)

/** Alias (User Manual Name) for VADC_G8_RESD11.
* To use register names with standard convension, please use VADC_G8_RESD11.
*/
#define	VADC_G8RESD11	(VADC_G8_RESD11)

/** \\brief  27B0, Group Result Reg., Debug */
#define VADC_G8_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00227B0u)

/** Alias (User Manual Name) for VADC_G8_RESD12.
* To use register names with standard convension, please use VADC_G8_RESD12.
*/
#define	VADC_G8RESD12	(VADC_G8_RESD12)

/** \\brief  27B4, Group Result Reg., Debug */
#define VADC_G8_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00227B4u)

/** Alias (User Manual Name) for VADC_G8_RESD13.
* To use register names with standard convension, please use VADC_G8_RESD13.
*/
#define	VADC_G8RESD13	(VADC_G8_RESD13)

/** \\brief  27B8, Group Result Reg., Debug */
#define VADC_G8_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00227B8u)

/** Alias (User Manual Name) for VADC_G8_RESD14.
* To use register names with standard convension, please use VADC_G8_RESD14.
*/
#define	VADC_G8RESD14	(VADC_G8_RESD14)

