keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** \\brief  27BC, Group Result Reg., Debug */
#define VADC_G8_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00227BCu)

/** Alias (User Manual Name) for VADC_G8_RESD15.
* To use register names with standard convension, please use VADC_G8_RESD15.
*/
#define	VADC_G8RESD15	(VADC_G8_RESD15)

/** \\brief  2788, Group Result Reg., Debug */
#define VADC_G8_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022788u)

/** Alias (User Manual Name) for VADC_G8_RESD2.
* To use register names with standard convension, please use VADC_G8_RESD2.
*/
#define	VADC_G8RESD2	(VADC_G8_RESD2)

/** \\brief  278C, Group Result Reg., Debug */
#define VADC_G8_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF002278Cu)

/** Alias (User Manual Name) for VADC_G8_RESD3.
* To use register names with standard convension, please use VADC_G8_RESD3.
*/
#define	VADC_G8RESD3	(VADC_G8_RESD3)

/** \\brief  2790, Group Result Reg., Debug */
#define VADC_G8_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022790u)

/** Alias (User Manual Name) for VADC_G8_RESD4.
* To use register names with standard convension, please use VADC_G8_RESD4.
*/
#define	VADC_G8RESD4	(VADC_G8_RESD4)

/** \\brief  2794, Group Result Reg., Debug */
#define VADC_G8_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022794u)

/** Alias (User Manual Name) for VADC_G8_RESD5.
* To use register names with standard convension, please use VADC_G8_RESD5.
*/
#define	VADC_G8RESD5	(VADC_G8_RESD5)

/** \\brief  2798, Group Result Reg., Debug */
#define VADC_G8_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022798u)

/** Alias (User Manual Name) for VADC_G8_RESD6.
* To use register names with standard convension, please use VADC_G8_RESD6.
*/
#define	VADC_G8RESD6	(VADC_G8_RESD6)

/** \\brief  279C, Group Result Reg., Debug */
#define VADC_G8_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF002279Cu)

/** Alias (User Manual Name) for VADC_G8_RESD7.
* To use register names with standard convension, please use VADC_G8_RESD7.
*/
#define	VADC_G8RESD7	(VADC_G8_RESD7)

/** \\brief  27A0, Group Result Reg., Debug */
#define VADC_G8_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00227A0u)

/** Alias (User Manual Name) for VADC_G8_RESD8.
* To use register names with standard convension, please use VADC_G8_RESD8.
*/
#define	VADC_G8RESD8	(VADC_G8_RESD8)

/** \\brief  27A4, Group Result Reg., Debug */
#define VADC_G8_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00227A4u)

/** Alias (User Manual Name) for VADC_G8_RESD9.
* To use register names with standard convension, please use VADC_G8_RESD9.
*/
#define	VADC_G8RESD9	(VADC_G8_RESD9)

/** \\brief  25B0, Result Event Node Pointer Register 0, Group */
#define VADC_G8_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF00225B0u)

/** Alias (User Manual Name) for VADC_G8_REVNP0.
* To use register names with standard convension, please use VADC_G8_REVNP0.
*/
#define	VADC_G8REVNP0	(VADC_G8_REVNP0)

/** \\brief  25B4, Result Event Node Pointer Register 1, Group */
#define VADC_G8_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF00225B4u)

/** Alias (User Manual Name) for VADC_G8_REVNP1.
* To use register names with standard convension, please use VADC_G8_REVNP1.
*/
#define	VADC_G8REVNP1	(VADC_G8_REVNP1)

/** \\brief  248C, Result Assignment Register, Group */
#define VADC_G8_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF002248Cu)

/** Alias (User Manual Name) for VADC_G8_RRASS.
* To use register names with standard convension, please use VADC_G8_RRASS.
*/
#define	VADC_G8RRASS	(VADC_G8_RRASS)

/** \\brief  2598, Source Event Flag Clear Register, Group */
#define VADC_G8_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0022598u)

/** Alias (User Manual Name) for VADC_G8_SEFCLR.
* To use register names with standard convension, please use VADC_G8_SEFCLR.
*/
#define	VADC_G8SEFCLR	(VADC_G8_SEFCLR)

/** \\brief  2588, Source Event Flag Register, Group */
#define VADC_G8_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0022588u)

/** Alias (User Manual Name) for VADC_G8_SEFLAG.
* To use register names with standard convension, please use VADC_G8_SEFLAG.
*/
#define	VADC_G8SEFLAG	(VADC_G8_SEFLAG)

/** \\brief  25C0, Source Event Node Pointer Register, Group */
#define VADC_G8_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00225C0u)

/** Alias (User Manual Name) for VADC_G8_SEVNP.
* To use register names with standard convension, please use VADC_G8_SEVNP.
*/
#define	VADC_G8SEVNP	(VADC_G8_SEVNP)

/** \\brief  25C8, Service Request Software Activation Trigger, Group */
#define VADC_G8_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00225C8u)

/** Alias (User Manual Name) for VADC_G8_SRACT.
* To use register names with standard convension, please use VADC_G8_SRACT.
*/
#define	VADC_G8SRACT	(VADC_G8_SRACT)

/** \\brief  24C0, Synchronization Control Register, Group */
#define VADC_G8_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00224C0u)

/** Alias (User Manual Name) for VADC_G8_SYNCTR.
* To use register names with standard convension, please use VADC_G8_SYNCTR.
*/
#define	VADC_G8SYNCTR	(VADC_G8_SYNCTR)

/** \\brief  25F8, Valid Flag Register, Group */
#define VADC_G8_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00225F8u)

/** Alias (User Manual Name) for VADC_G8_VFR.
* To use register names with standard convension, please use VADC_G8_VFR.
*/
#define	VADC_G8VFR	(VADC_G8_VFR)

/** \\brief  28B0, Alias Register, Group */
#define VADC_G9_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF00228B0u)

/** Alias (User Manual Name) for VADC_G9_ALIAS.
* To use register names with standard convension, please use VADC_G9_ALIAS.
*/
#define	VADC_G9ALIAS	(VADC_G9_ALIAS)

/** \\brief  2880, Arbitration Configuration Register, Group */
#define VADC_G9_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0022880u)

/** Alias (User Manual Name) for VADC_G9_ARBCFG.
* To use register names with standard convension, please use VADC_G9_ARBCFG.
*/
#define	VADC_G9ARBCFG	(VADC_G9_ARBCFG)

/** \\brief  2884, Arbitration Priority Register, Group */
#define VADC_G9_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0022884u)

/** Alias (User Manual Name) for VADC_G9_ARBPR.
* To use register names with standard convension, please use VADC_G9_ARBPR.
*/
#define	VADC_G9ARBPR	(VADC_G9_ARBPR)

/** \\brief  2920, Autoscan Source Control Register, Group */
#define VADC_G9_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0022920u)

/** Alias (User Manual Name) for VADC_G9_ASCTRL.
* To use register names with standard convension, please use VADC_G9_ASCTRL.
*/
#define	VADC_G9ASCTRL	(VADC_G9_ASCTRL)

/** \\brief  2924, Autoscan Source Mode Register, Group */
#define VADC_G9_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0022924u)

/** Alias (User Manual Name) for VADC_G9_ASMR.
* To use register names with standard convension, please use VADC_G9_ASMR.
*/
#define	VADC_G9ASMR	(VADC_G9_ASMR)

/** \\brief  292C, Autoscan Source Pending Register, Group */
#define VADC_G9_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF002292Cu)

/** Alias (User Manual Name) for VADC_G9_ASPND.
* To use register names with standard convension, please use VADC_G9_ASPND.
*/
#define	VADC_G9ASPND	(VADC_G9_ASPND)

