keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** \\brief  2A20, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A20u)

/** \\brief  2A24, Group, Channel Ctrl. Reg. */
#define VADC_G9_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022A24u)

/** \\brief  29F0, External Multiplexer Control Register, Group x */
#define VADC_G9_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00229F0u)

/** Alias (User Manual Name) for VADC_G9_EMUXCTR.
* To use register names with standard convension, please use VADC_G9_EMUXCTR.
*/
#define	VADC_G9EMUXCTR	(VADC_G9_EMUXCTR)

/** \\brief  28A0, Input Class Register */
#define VADC_G9_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00228A0u)

/** Alias (User Manual Name) for VADC_G9_ICLASS0.
* To use register names with standard convension, please use VADC_G9_ICLASS0.
*/
#define	VADC_G9ICLASS0	(VADC_G9_ICLASS0)

/** \\brief  28A4, Input Class Register */
#define VADC_G9_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00228A4u)

/** Alias (User Manual Name) for VADC_G9_ICLASS1.
* To use register names with standard convension, please use VADC_G9_ICLASS1.
*/
#define	VADC_G9ICLASS1	(VADC_G9_ICLASS1)

/** \\brief  290C, Queue 0 Register 0, Group */
#define VADC_G9_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002290Cu)

/** Alias (User Manual Name) for VADC_G9_Q0R0.
* To use register names with standard convension, please use VADC_G9_Q0R0.
*/
#define	VADC_G9Q0R0	(VADC_G9_Q0R0)

/** \\brief  2910, Queue 0 Input Register, Group */
#define VADC_G9_QBUR_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR_QINR0*)0xF0022910u)

/** Alias (User Manual Name) for VADC_G9_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G9_QBUR_QINR0.
*/
#define	VADC_G9QINR0	(VADC_G9_QBUR_QINR0)

/** Alias (User Manual Name) for VADC_G9_QBUR_QINR0.
* To use register names with standard convension, please use VADC_G9_QBUR_QINR0.
*/
#define	VADC_G9QBUR0	(VADC_G9_QBUR_QINR0)

/** \\brief  2900, Queue 0 Source Control Register, Group */
#define VADC_G9_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0022900u)

/** Alias (User Manual Name) for VADC_G9_QCTRL0.
* To use register names with standard convension, please use VADC_G9_QCTRL0.
*/
#define	VADC_G9QCTRL0	(VADC_G9_QCTRL0)

/** \\brief  2904, Queue 0 Mode Register, Group */
#define VADC_G9_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0022904u)

/** Alias (User Manual Name) for VADC_G9_QMR0.
* To use register names with standard convension, please use VADC_G9_QMR0.
*/
#define	VADC_G9QMR0	(VADC_G9_QMR0)

/** \\brief  2908, Queue 0 Status Register, Group */
#define VADC_G9_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0022908u)

/** Alias (User Manual Name) for VADC_G9_QSR0.
* To use register names with standard convension, please use VADC_G9_QSR0.
*/
#define	VADC_G9QSR0	(VADC_G9_QSR0)

/** \\brief  2A80, Group Result Control Reg. */
#define VADC_G9_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A80u)

/** Alias (User Manual Name) for VADC_G9_RCR0.
* To use register names with standard convension, please use VADC_G9_RCR0.
*/
#define	VADC_G9RCR0	(VADC_G9_RCR0)

/** \\brief  2A84, Group Result Control Reg. */
#define VADC_G9_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A84u)

/** Alias (User Manual Name) for VADC_G9_RCR1.
* To use register names with standard convension, please use VADC_G9_RCR1.
*/
#define	VADC_G9RCR1	(VADC_G9_RCR1)

/** \\brief  2AA8, Group Result Control Reg. */
#define VADC_G9_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AA8u)

/** Alias (User Manual Name) for VADC_G9_RCR10.
* To use register names with standard convension, please use VADC_G9_RCR10.
*/
#define	VADC_G9RCR10	(VADC_G9_RCR10)

/** \\brief  2AAC, Group Result Control Reg. */
#define VADC_G9_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AACu)

/** Alias (User Manual Name) for VADC_G9_RCR11.
* To use register names with standard convension, please use VADC_G9_RCR11.
*/
#define	VADC_G9RCR11	(VADC_G9_RCR11)

/** \\brief  2AB0, Group Result Control Reg. */
#define VADC_G9_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AB0u)

/** Alias (User Manual Name) for VADC_G9_RCR12.
* To use register names with standard convension, please use VADC_G9_RCR12.
*/
#define	VADC_G9RCR12	(VADC_G9_RCR12)

/** \\brief  2AB4, Group Result Control Reg. */
#define VADC_G9_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AB4u)

/** Alias (User Manual Name) for VADC_G9_RCR13.
* To use register names with standard convension, please use VADC_G9_RCR13.
*/
#define	VADC_G9RCR13	(VADC_G9_RCR13)

/** \\brief  2AB8, Group Result Control Reg. */
#define VADC_G9_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022AB8u)

/** Alias (User Manual Name) for VADC_G9_RCR14.
* To use register names with standard convension, please use VADC_G9_RCR14.
*/
#define	VADC_G9RCR14	(VADC_G9_RCR14)

/** \\brief  2ABC, Group Result Control Reg. */
#define VADC_G9_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022ABCu)

/** Alias (User Manual Name) for VADC_G9_RCR15.
* To use register names with standard convension, please use VADC_G9_RCR15.
*/
#define	VADC_G9RCR15	(VADC_G9_RCR15)

/** \\brief  2A88, Group Result Control Reg. */
#define VADC_G9_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A88u)

/** Alias (User Manual Name) for VADC_G9_RCR2.
* To use register names with standard convension, please use VADC_G9_RCR2.
*/
#define	VADC_G9RCR2	(VADC_G9_RCR2)

/** \\brief  2A8C, Group Result Control Reg. */
#define VADC_G9_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A8Cu)

/** Alias (User Manual Name) for VADC_G9_RCR3.
* To use register names with standard convension, please use VADC_G9_RCR3.
*/
#define	VADC_G9RCR3	(VADC_G9_RCR3)

/** \\brief  2A90, Group Result Control Reg. */
#define VADC_G9_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A90u)

/** Alias (User Manual Name) for VADC_G9_RCR4.
* To use register names with standard convension, please use VADC_G9_RCR4.
*/
#define	VADC_G9RCR4	(VADC_G9_RCR4)

/** \\brief  2A94, Group Result Control Reg. */
#define VADC_G9_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A94u)

/** Alias (User Manual Name) for VADC_G9_RCR5.
* To use register names with standard convension, please use VADC_G9_RCR5.
*/
#define	VADC_G9RCR5	(VADC_G9_RCR5)

/** \\brief  2A98, Group Result Control Reg. */
#define VADC_G9_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A98u)

/** Alias (User Manual Name) for VADC_G9_RCR6.
* To use register names with standard convension, please use VADC_G9_RCR6.
*/
#define	VADC_G9RCR6	(VADC_G9_RCR6)

/** \\brief  2A9C, Group Result Control Reg. */
#define VADC_G9_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0022A9Cu)

