keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxVadc_reg.h
/** \\brief  2BAC, Group Result Reg., Debug */
#define VADC_G9_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BACu)

/** Alias (User Manual Name) for VADC_G9_RESD11.
* To use register names with standard convension, please use VADC_G9_RESD11.
*/
#define	VADC_G9RESD11	(VADC_G9_RESD11)

/** \\brief  2BB0, Group Result Reg., Debug */
#define VADC_G9_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BB0u)

/** Alias (User Manual Name) for VADC_G9_RESD12.
* To use register names with standard convension, please use VADC_G9_RESD12.
*/
#define	VADC_G9RESD12	(VADC_G9_RESD12)

/** \\brief  2BB4, Group Result Reg., Debug */
#define VADC_G9_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BB4u)

/** Alias (User Manual Name) for VADC_G9_RESD13.
* To use register names with standard convension, please use VADC_G9_RESD13.
*/
#define	VADC_G9RESD13	(VADC_G9_RESD13)

/** \\brief  2BB8, Group Result Reg., Debug */
#define VADC_G9_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BB8u)

/** Alias (User Manual Name) for VADC_G9_RESD14.
* To use register names with standard convension, please use VADC_G9_RESD14.
*/
#define	VADC_G9RESD14	(VADC_G9_RESD14)

/** \\brief  2BBC, Group Result Reg., Debug */
#define VADC_G9_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BBCu)

/** Alias (User Manual Name) for VADC_G9_RESD15.
* To use register names with standard convension, please use VADC_G9_RESD15.
*/
#define	VADC_G9RESD15	(VADC_G9_RESD15)

/** \\brief  2B88, Group Result Reg., Debug */
#define VADC_G9_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022B88u)

/** Alias (User Manual Name) for VADC_G9_RESD2.
* To use register names with standard convension, please use VADC_G9_RESD2.
*/
#define	VADC_G9RESD2	(VADC_G9_RESD2)

/** \\brief  2B8C, Group Result Reg., Debug */
#define VADC_G9_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022B8Cu)

/** Alias (User Manual Name) for VADC_G9_RESD3.
* To use register names with standard convension, please use VADC_G9_RESD3.
*/
#define	VADC_G9RESD3	(VADC_G9_RESD3)

/** \\brief  2B90, Group Result Reg., Debug */
#define VADC_G9_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022B90u)

/** Alias (User Manual Name) for VADC_G9_RESD4.
* To use register names with standard convension, please use VADC_G9_RESD4.
*/
#define	VADC_G9RESD4	(VADC_G9_RESD4)

/** \\brief  2B94, Group Result Reg., Debug */
#define VADC_G9_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022B94u)

/** Alias (User Manual Name) for VADC_G9_RESD5.
* To use register names with standard convension, please use VADC_G9_RESD5.
*/
#define	VADC_G9RESD5	(VADC_G9_RESD5)

/** \\brief  2B98, Group Result Reg., Debug */
#define VADC_G9_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022B98u)

/** Alias (User Manual Name) for VADC_G9_RESD6.
* To use register names with standard convension, please use VADC_G9_RESD6.
*/
#define	VADC_G9RESD6	(VADC_G9_RESD6)

/** \\brief  2B9C, Group Result Reg., Debug */
#define VADC_G9_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022B9Cu)

/** Alias (User Manual Name) for VADC_G9_RESD7.
* To use register names with standard convension, please use VADC_G9_RESD7.
*/
#define	VADC_G9RESD7	(VADC_G9_RESD7)

/** \\brief  2BA0, Group Result Reg., Debug */
#define VADC_G9_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BA0u)

/** Alias (User Manual Name) for VADC_G9_RESD8.
* To use register names with standard convension, please use VADC_G9_RESD8.
*/
#define	VADC_G9RESD8	(VADC_G9_RESD8)

/** \\brief  2BA4, Group Result Reg., Debug */
#define VADC_G9_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022BA4u)

/** Alias (User Manual Name) for VADC_G9_RESD9.
* To use register names with standard convension, please use VADC_G9_RESD9.
*/
#define	VADC_G9RESD9	(VADC_G9_RESD9)

/** \\brief  29B0, Result Event Node Pointer Register 0, Group */
#define VADC_G9_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF00229B0u)

/** Alias (User Manual Name) for VADC_G9_REVNP0.
* To use register names with standard convension, please use VADC_G9_REVNP0.
*/
#define	VADC_G9REVNP0	(VADC_G9_REVNP0)

/** \\brief  29B4, Result Event Node Pointer Register 1, Group */
#define VADC_G9_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF00229B4u)

/** Alias (User Manual Name) for VADC_G9_REVNP1.
* To use register names with standard convension, please use VADC_G9_REVNP1.
*/
#define	VADC_G9REVNP1	(VADC_G9_REVNP1)

/** \\brief  288C, Result Assignment Register, Group */
#define VADC_G9_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF002288Cu)

/** Alias (User Manual Name) for VADC_G9_RRASS.
* To use register names with standard convension, please use VADC_G9_RRASS.
*/
#define	VADC_G9RRASS	(VADC_G9_RRASS)

/** \\brief  2998, Source Event Flag Clear Register, Group */
#define VADC_G9_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0022998u)

/** Alias (User Manual Name) for VADC_G9_SEFCLR.
* To use register names with standard convension, please use VADC_G9_SEFCLR.
*/
#define	VADC_G9SEFCLR	(VADC_G9_SEFCLR)

/** \\brief  2988, Source Event Flag Register, Group */
#define VADC_G9_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0022988u)

/** Alias (User Manual Name) for VADC_G9_SEFLAG.
* To use register names with standard convension, please use VADC_G9_SEFLAG.
*/
#define	VADC_G9SEFLAG	(VADC_G9_SEFLAG)

/** \\brief  29C0, Source Event Node Pointer Register, Group */
#define VADC_G9_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00229C0u)

/** Alias (User Manual Name) for VADC_G9_SEVNP.
* To use register names with standard convension, please use VADC_G9_SEVNP.
*/
#define	VADC_G9SEVNP	(VADC_G9_SEVNP)

/** \\brief  29C8, Service Request Software Activation Trigger, Group */
#define VADC_G9_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00229C8u)

/** Alias (User Manual Name) for VADC_G9_SRACT.
* To use register names with standard convension, please use VADC_G9_SRACT.
*/
#define	VADC_G9SRACT	(VADC_G9_SRACT)

/** \\brief  28C0, Synchronization Control Register, Group */
#define VADC_G9_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00228C0u)

/** Alias (User Manual Name) for VADC_G9_SYNCTR.
* To use register names with standard convension, please use VADC_G9_SYNCTR.
*/
#define	VADC_G9SYNCTR	(VADC_G9_SYNCTR)

/** \\brief  29F8, Valid Flag Register, Group */
#define VADC_G9_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00229F8u)

/** Alias (User Manual Name) for VADC_G9_VFR.
* To use register names with standard convension, please use VADC_G9_VFR.
*/
#define	VADC_G9VFR	(VADC_G9_VFR)

/** \\brief  B8, Global Boundary Select Register */
#define VADC_GLOBBOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBBOUND*)0xF00200B8u)

/** \\brief  80, Global Configuration Register */
#define VADC_GLOBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBCFG*)0xF0020080u)

